<html>
<head>
<title>Practica dos : Enlaces, tablas y github </title>
<link rel="stylesheet" type="text/css" href="estilos.css">
</head>
<body>
<a name=inicio> </a>
<a href=#abajo>ir a mis enlaces</a>
<a href=#mitad>ir a URL</a>
<h1>Cap&iacute;tulo 4. Enlaces</h1>

<p>El lenguaje de marcado HTML se definió teniendo en cuenta algunas de las caracter&iacute;sticas que exist&iacute;an en ese momento para la publicación digital de contenidos. Entre los conceptos utilizados en su creación, se encuentra el mecanismo de "hipertexto".</p>

<p>De hecho, las letras "HT" de la sigla HTML significan "hipertexto" (hypertext en ingl&eacute;s), por lo que el significado completo de HTML podr&iacute;a traducirse como "lenguaje de marcado para hipertexto".</p>

<p>La incorporación del hipertexto fue una de las claves del &eacute;xito del lenguaje HTML, ya que permitió crear documentos interactivos que proporcionan información adicional cuando se solicita. El elemento principal del hipertexto es el "hiperenlace", tambi&eacute;n llamado "enlace web" o simplemente "enlace".</p>

<p>Los enlaces se utilizan para establecer relaciones entre dos recursos. Aunque la mayor&iacute;a de enlaces relacionan p&aacute;ginas web, tambi&eacute;n es posible enlazar otros recursos como im&aacute;genes, documentos y archivos.</p>

<p>Una caracter&iacute;stica que no se suele tener en cuenta en los enlaces es que est&aacute;n formados por dos extremos y un sentido. En otras palabras, el enlace comienza en un recurso y apunta hacia otro recurso. Cada uno de los dos extremos se llaman "anchors" en ingl&eacute;s, que se puede traducir literalmente como "anclas".</p>
<div>
<img src="imagenes/img1.jpg"width=400 />
</div>
<a name=mitad> </a>
<h2>4.1. URL</h2>

<p>Antes de empezar a crear enlaces, es necesario comprender y dominar el concepto de URL. El acrónimo URL (del ingl&eacute;s Uniform Resource Locator) hace referencia al identificador único de cada recurso disponible en Internet. Las URL son esenciales para crear los enlaces, pero tambi&eacute;n se utilizan en otros elementos HTML como las im&aacute;genes y los formularios.<p>

<ul>La URL de un recurso tiene dos objetivos principales:

<li>Identificar de forma única a ese recurso</li>
<li>Permitir localizar de forma eficiente ese recurso</li>
</ul>
<p>En primer lugar, las URL permiten que cada p&aacute;gina HTML publicada en Internet tenga un nombre único que permita diferenciarla de las dem&aacute;s. De esta forma es posible crear enlaces que apunten de forma inequívoca a una determinada p&aacute;gina.</p>

<p>Si se accede a la p&aacute;gina principal de Google, la dirección que muestra el navegador es:
<br>
http://www.google.com
La cadena de texto http://www.google.com es la URL completa de la p&aacute;gina principal de Google. La URL de las p&aacute;ginas es imprescindible para crear los enlaces, ya que permite distinguir una p&aacute;gina de otra.</p>
</br>
<img src="imagenes/img2.jpg"/>

<p>El segundo objetivo de las <acronym title="Localisador uniforme de recursos"> URL </acronym> es el de permitir la localización eficiente de cada recurso de Internet. Para ello es necesario comprender las diferentes partes que forman las URL. Una URL sencilla siempre est&aacute; formada por las mismas tres partes. Si por ejemplo se considera la siguiente URL:

http://www.librosweb.es/xhtml/capitulo4.html
<ul>Las partes que componen la URL anterior son:
<br>
<li>Protocolo (http://): el mecanismo que debe utilizar el navegador para acceder a ese recurso. Todas las p&aacute;ginas web utilizan http://. Las p&aacute;ginas web seguras (por ejemplo las de los bancos y las de los servicios de email) utilizan https:// (se añade una letra s).</li>
</br>
<br>
<li>Servidor (www.librosweb.es): simplificando mucho su explicación, se trata del ordenador en el que se encuentra guardada la p&aacute;gina que se quiere acceder. Los navegadores son capaces de obtener la dirección de cada servidor a partir de su nombre.</li>
</br>
<br>
<li>Ruta (/xhtml/capitulo4.html): camino que se debe seguir, una vez que se ha llegado al servidor, para localizar el recurso específico que se quiere acceder</li>.
</br>
</ul>
</p>
<p>Por tanto, las URL no sólo identifican de forma única a cada recurso de Internet, sino que tambi&eacute;n proporcionan a los navegadores la información necesaria para poder llegar hasta ese recurso.</p>
<a name=abajo> </a>
<p><h2>mis enlases</h2>
<a href="tablas/tablas1.html">Vaya a ver la tabla basica</a></br>
<a href="tablas/tablas1.html">o mejor, ver la tabla irregular</a></br>
 <a href=#inicio>Ir arriba</a>
</p>
</body>
</html>